{"id":1,"review":"You have limited selection of maps and you need to level-up to unlock new weapons. When it comes down to it, there are too many things Nintendo could have cut from Splatoon 2 to turn it into a faster, more furious, and more focused game. Nonethless, it is still quite a good game. If you're interested in this genre, it's worth to have a look at it!"}
{"id":2,"review":"Above all else, Animal Crossing: New Horizons is an unbeatable feel-good experience and an essential purchase for anyone that owns a Nintendo Switch. As heart-warming as it is wholesome, Nintendo has delivered meaningful changes that help to structure your peaceful island existence."}
{"id":3,"review":"Where it takes mechanics from others in the industry, it improves upon them; where it introduces new ones, you slap your forehead in amazement that it hasn’t been done before. Breath of the Wild is development done right, and probably the best game you’ll play all year."}
{"id":4,"review":"Stardew Valley provides you an experience that just grows more and more as you play. Every little thing, from planting to befriending the community, becomes surprisingly meaningful as your hard works comes to life in front of you. With tons of content, it’ll keep you hooked into living this calm, pleasurable and magical second life, all made better with Switch’s portability."}
{"id":5,"review":"It's a world that feels huge at first, then small as you get to know it, and then huge again as you realize how fantastically dense it is with secrets and challenges. It gives you a simple set of tools and then asks you to do something different with them every ten minutes. Super Mario Odyssey is a fun game, an unoriginal observation that feels nonetheless vital in the modern gaming landscape. It is a game that tasks you with finding joy, and then lets you point yourself in the right direction. It is a game you should play."}
{"id":6,"review":"Super Mario Maker 2 is another Nintendo Switch essential. With more things to create with, more unique stages to play and better online functionality, this is the definitive Super Mario Maker experience. Honestly, the game is good enough to have the story mode sold separately, but the fact that it's bundled with such a powerful stage creation tool is incredible."}
{"id":7,"review":"Luigi's Mansion 3 is yet another excellent Nintendo exclusive and is the perfect antidote to the doom and gloom that runs rampant in the horror genre these days. It may not do everything perfectly, but from a technical side, I'm hard-pressed to think of a better-looking game on the Switch this year. It may not have the challenge some are looking for, but when the rest of the game is this wonderfully presented, it's hard not to just get sucked right along for the fun-filled, spooky adventure."}
{"id":8,"review":"At its heart, playing Mario Kart 8 Deluxe is a completely different experience to playing Mario Kart 8 precisely because of how, and where, you play it. The feel and fun of the thing is an intrinsic part of gaming and there's just so much fun to be had when you throw portability and local multiplayer into the fray."}
{"id":9,"review":"Super Smash Bros. Ultimate is equal parts greatness and lacking. The sheer wealth of content and great gameplay is commended but there are big holes in what could be a great game."}
{"id":10,"review":"At its core, the game itself remains pretty good - it is, after all, the same as FIFA 19 - the product being sold under this name is simply not what EA should be presenting to its consumers. While updated squads and jerseys fit perfectly with the idea of a regular update to a football simulation, charging a full game's price for nothing but an update is simply unacceptable."}
{"id":11,"review":"Slot machines, roulette, ball drop, card packs, and this is something kids (and adults) can unfortunately spend large sums of money on. The game itself is pay-to-win and unsatisfying. We couldn’t recommend this game to anyone."}
